#+TITLE:BURST shotgun analysis pipeline
* Download references and prepare BURST database
#+BEGIN_SRC R :session rlocal :results output verbatim
library(here)
library(tidyverse)

refs <- here("output", "strain-data", "reference-genome-metadata.Rds") %>% readRDS
#+END_SRC

#+RESULTS: (deleted)

Get a list of ftp paths to download onto the BRC cluster
#+BEGIN_SRC R :session rlocal :results output verbatim
urls <- refs %>%
  transmute(url = file.path(ftp_path, ftp_genome_file)) %>%
  pull(url)
head(urls, 2)
#+END_SRC

#+RESULTS:
: [1] "ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCF/000/011/065/GCF_000011065.1_ASM1106v1/GCF_000011065.1_ASM1106v1_genomic.fna.gz"
: [2] "ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCF/000/017/765/GCF_000017765.1_ASM1776v1/GCF_000017765.1_ASM1776v1_genomic.fna.gz"

Set up a place to download these files,

#+BEGIN_SRC shell :session brc :results output verbatim
cd $main_path/data/references/bacteria
ls
mkdir v2
cd v2
#+END_SRC

#+RESULTS: (deleted)

And download with a wget command that we create w/in R but run on the BRC,

#+NAME: wget_cmd
#+BEGIN_SRC R :session rlocal :results value verbatim
cmd <- str_c(urls, collapse = " ") %>% str_c("wget", ., sep = " ")
cmd
#+END_SRC

#+BEGIN_SRC shell :session brc :results output verbatim :var cmd=wget_cmd
eval $cmd
#+END_SRC

#+RESULTS: (deleted)

Combine and linearize the genomes, then create a BURST database for up to 150bp and 0.97 identity.

#+BEGIN_SRC shell :session brc :results output verbatim
mkdir burst
# Combine and linearize genomes
zcat *.fna.gz | seqtk seq - > burst/all-genomes.fasta
#+END_SRC

#+RESULTS: (deleted)

#+BEGIN_SRC shell :session brc :results output verbatim
burst_linux_DB12 -r burst/all-genomes.fasta \
  -a burst/db.acx -o burst/db.edx \
  -d DNA -s 1500 -i 0.97 -t 8
#+END_SRC

#+RESULTS:
: burst_linux_DB12 -r burst/all-genomes.fasta \[?2004l
: [?2004h  -a burst/db.acx -o burst/db.edx \[?2004l
: [?2004h  -d DNA -s 1500 -i 0.97 -t 8[?2004l
: This is BURST [v1.0 DB 12]
: Using accelerator file burst/db.acx
: Creating DNA database (assuming max query length 500)
: Shearing references longer than 1500
: Setting identity threshold to 0.970000
